Revit 2026 API

# ImporterIFCUtilsUpdateDirectShapeCategory Method

---

Updates the category of a DirectShape.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void UpdateDirectShapeCategory(
	DirectShape directShape,
	ElementId newCategoryId
)
```
```vb
Public Shared Sub UpdateDirectShapeCategory (
	directShape As DirectShape,
	newCategoryId As ElementId
)
```
```cpp
public:
static void UpdateDirectShapeCategory(
	DirectShape^ directShape,
	ElementId^ newCategoryId
)
```
```fsharp
static member UpdateDirectShapeCategory :
        directShape : DirectShape *
        newCategoryId : ElementId -> unit
```

#### Parameters

directShape DirectShape
     The DirectShape.
newCategoryId ElementId
     The new category id.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Use this function carefully, as it could result in a mismatch between DirectShape and DirectShapeType categories.

#### Reference

ImporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace